# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep ='|')

In [3]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [4]:
df.isnull().sum()

user_id       0
age           0
gender        0
occupation    0
zip_code      0
dtype: int64

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [5]:
df.index = df.user_id

In [6]:
df.head()

         user_id  age gender  occupation zip_code
user_id
1              1   24      M  technician    85711
2              2   53      F       other    94043
3              3   23      M      writer    32067
4              4   24      M  technician    43537
5              5   33      F       other    15213

### Step 4. See the first 25 entries

In [7]:
df.head(25)

         user_id  age gender     occupation zip_code
user_id
1              1   24      M     technician    85711
2              2   53      F          other    94043
3              3   23      M         writer    32067
4              4   24      M     technician    43537
5              5   33      F          other    15213
6              6   42      M      executive    98101
7              7   57      M  administrator    91344
8              8   36      M  administrator    05201
9              9   29      M        student    01002
10            10   53      M         lawyer    90703
11            11   39      F          other    30329
12            12   28      F          other    06405
13            13   47      M       educator    29206
14            14   45      M      scientist    55106
15            15   49      F       educator    97301
16            16   21      M  entertainment    10309
17            17   30      M     programmer    06355
18            18   35      F          other    37212
19            19   40      M      librarian    02138
20            20   42      F      homemaker    95660
21            21   26      M         writer    30068
22            22   25      M         writer    40206
23            23   30      F         artist    48197
24            24   21      F         artist    94533
25            25   39      M       engineer    55107

### Step 5. See the last 10 entries

In [8]:
df.tail(10)

         user_id  age gender     occupation zip_code
user_id
934          934   61      M       engineer    22902
935          935   42      M         doctor    66221
936          936   24      M          other    32789
937          937   48      M       educator    98072
938          938   38      F     technician    55038
939          939   26      F        student    33319
940          940   32      M  administrator    02215
941          941   20      M        student    97229
942          942   48      F      librarian    78209
943          943   22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [9]:
df.shape

(943, 5)

### Step 7. What is the number of columns in the dataset?

In [10]:
len(df.columns)

5

### Step 8. Print the name of all the columns.

In [11]:
df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [12]:
# Ascending

### Step 10. What is the data type of each column?

In [13]:
df.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [14]:
df.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [15]:
len(df.occupation.value_counts())

21

### Step 13. What is the most frequent occupation?

In [16]:
df.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

### Step 14. Summarize the DataFrame.

In [17]:
df.describe().T

         count        mean         std  min    25%    50%    75%    max
user_id  943.0  472.000000  272.364951  1.0  236.5  472.0  707.5  943.0
age      943.0   34.051962   12.192740  7.0   25.0   31.0   43.0   73.0

### Step 15. Summarize all the columns

In [19]:
df.gender.unique()

array(['M', 'F'], dtype=object)

### Step 16. Summarize only the occupation column

In [ ]:
df.occupation.describe().T

### Step 17. What is the mean age of users?

In [ ]:
round(df.age.mean(),2)

### Step 18. What is the age with least occurrence?

In [ ]:
df.age.value_counts()